Jiu-xiao/libxr/test/hardware/esp32s3_uart_loopback/main/esp_uart_fifo_test.cpp
#include "esp_uart_fifo_test.hpp"

#include <algorithm>
#include <atomic>
#include <climits>
#include <cstring>

#include "driver/uart.h"
#include "hal/uart_ll.h"
#include "libxr.hpp"
#include "soc/soc_caps.h"

namespace LibXRTest
{
namespace
{

constexpr uint32_t RX_DATA_INTR_MASK = UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT;
constexpr uint32_t RX_ERROR_INTR_MASK =
    UART_INTR_PARITY_ERR | UART_INTR_FRAM_ERR | UART_INTR_RXFIFO_OVF;
constexpr uint32_t RX_INTR_MASK = RX_DATA_INTR_MASK | RX_ERROR_INTR_MASK;

uint64_t ElapsedMicroseconds(uint64_t start_us)
{
  return static_cast<uint64_t>(LibXR::Timebase::GetMicroseconds()) - start_us;
}

bool TimedOut(uint32_t start_ms, uint32_t timeout_ms)
{
  const uint32_t now_ms = static_cast<uint32_t>(LibXR::Timebase::GetMilliseconds());
  return static_cast<uint32_t>(now_ms - start_ms) >= timeout_ms;
}

template <typename Predicate>
bool WaitUntil(Predicate predicate, uint32_t timeout_ms)
{
  const uint32_t start_ms = static_cast<uint32_t>(LibXR::Timebase::GetMilliseconds());
  do
  {
    if (predicate())
    {
      return true;
    }
    LibXR::Thread::Sleep(1U);
  } while (!TimedOut(start_ms, timeout_ms));
  return predicate();
}

uint8_t PatternByte(size_t offset, uint32_t seed)
{
  uint32_t value = seed ^ static_cast<uint32_t>(offset * 0x45D9F3BU);
  value ^= value >> 16U;
  value *= 0x7FEB352DU;
  value ^= value >> 15U;
  return static_cast<uint8_t>(value >> 24U);
}

void FillPattern(uint8_t* output, size_t size, size_t offset, uint32_t seed)
{
  for (size_t i = 0U; i < size; ++i)
  {
    output[i] = PatternByte(offset + i, seed);
  }
}

bool MatchesPattern(const uint8_t* input, size_t size, size_t offset, uint32_t seed)
{
  for (size_t i = 0U; i < size; ++i)
  {
    if (input[i] != PatternByte(offset + i, seed))
    {
      return false;
    }
  }
  return true;
}

size_t FindPatternMismatch(const uint8_t* input, size_t size, uint32_t seed)
{
  for (size_t i = 0U; i < size; ++i)
  {
    if (input[i] != PatternByte(i, seed))
    {
      return i;
    }
  }
  return size;
}

bool MakeObserverConfig(LibXR::UART::Configuration config, uart_config_t& output)
{
  if ((config.baudrate == 0U) || (config.baudrate > static_cast<uint32_t>(INT_MAX)))
  {
    return false;
  }

  output = {};
  output.baud_rate = static_cast<int>(config.baudrate);
  switch (config.data_bits)
  {
    case 5U:
      output.data_bits = UART_DATA_5_BITS;
      break;
    case 6U:
      output.data_bits = UART_DATA_6_BITS;
      break;
    case 7U:
      output.data_bits = UART_DATA_7_BITS;
      break;
    case 8U:
      output.data_bits = UART_DATA_8_BITS;
      break;
    default:
      return false;
  }

  switch (config.parity)
  {
    case LibXR::UART::Parity::NO_PARITY:
      output.parity = UART_PARITY_DISABLE;
      break;
    case LibXR::UART::Parity::EVEN:
      output.parity = UART_PARITY_EVEN;
      break;
    case LibXR::UART::Parity::ODD:
      output.parity = UART_PARITY_ODD;
      break;
    default:
      return false;
  }

  switch (config.stop_bits)
  {
    case 1U:
      output.stop_bits = UART_STOP_BITS_1;
      break;
    case 2U:
      output.stop_bits = UART_STOP_BITS_2;
      break;
    default:
      return false;
  }
  output.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
  output.source_clk = UART_SCLK_DEFAULT;
  return true;
}

class UartRxObserver
{
 public:
  explicit UartRxObserver(uart_port_t uart_num) : uart_num_(uart_num) {}

  ~UartRxObserver() { (void)Close(); }

  LibXR::ErrorCode Open(int rx_pin, size_t buffer_size, LibXR::UART::Configuration config)
  {
    uart_config_t idf_config{};
    if ((rx_pin < 0) || (buffer_size <= UART_HW_FIFO_LEN(uart_num_)) ||
        (buffer_size > static_cast<size_t>(INT_MAX)) ||
        !MakeObserverConfig(config, idf_config) || uart_is_driver_installed(uart_num_))
    {
      return LibXR::ErrorCode::ARG_ERR;
    }
    if (uart_driver_install(uart_num_, static_cast<int>(buffer_size), 0, 0, nullptr, 0) !=
        ESP_OK)
    {
      return LibXR::ErrorCode::INIT_ERR;
    }
    installed_ = true;
    if ((uart_param_config(uart_num_, &idf_config) != ESP_OK) ||
        (uart_set_pin(uart_num_, UART_PIN_NO_CHANGE, rx_pin, UART_PIN_NO_CHANGE,
                      UART_PIN_NO_CHANGE) != ESP_OK) ||
        (uart_flush_input(uart_num_) != ESP_OK))
    {
      (void)Close();
      return LibXR::ErrorCode::INIT_ERR;
    }
    return LibXR::ErrorCode::OK;
  }

  size_t Read(uint8_t* output, size_t size, uint32_t timeout_ms, bool& read_failed)
  {
    size_t total = 0U;
    const uint32_t start_ms = static_cast<uint32_t>(LibXR::Timebase::GetMilliseconds());
    while ((total < size) && !TimedOut(start_ms, timeout_ms))
    {
      const int read_size =
          uart_read_bytes(uart_num_, output + total, static_cast<uint32_t>(size - total),
                          pdMS_TO_TICKS(1U));
      if (read_size < 0)
      {
        read_failed = true;
        break;
      }
      total += static_cast<size_t>(read_size);
    }
    return total;
  }

  LibXR::ErrorCode Close()
  {
    if (!installed_)
    {
      return LibXR::ErrorCode::OK;
    }
    if (uart_driver_delete(uart_num_) != ESP_OK)
    {
      return LibXR::ErrorCode::FAILED;
    }
    installed_ = false;
    return LibXR::ErrorCode::OK;
  }

 private:
  uart_port_t uart_num_;
  bool installed_ = false;
};

UartStressTrafficBarrierCase MakeBarrierCase(LibXR::UART::Configuration config,
                                             uint32_t timeout_ms, uint32_t quiet_time_ms)
{
  return {
      .final_config = config,
      .config_timeout_ms = timeout_ms,
      .marker_timeout_ms = timeout_ms,
      .retry_interval_ms = 1U,
      .rx_quiet_time_ms = quiet_time_ms,
  };
}

UartLoopbackTestCase MakeRecoveryCase(LibXR::UART::Configuration config,
                                      uint32_t timeout_ms, uint32_t quiet_time_ms,
                                      uint32_t seed)
{
  return {
      .uart_config = config,
      .frame_size = 1023U,
      .rounds = 2U,
      .operation_timeout_ms = timeout_ms,
      .rx_quiet_time_ms = quiet_time_ms,
      .pattern_seed = seed,
      .batch_depth = 2U,
  };
}

struct CallbackState
{
  std::atomic<uint32_t> count{0U};
  std::atomic<int32_t> last_error{static_cast<int32_t>(LibXR::ErrorCode::OK)};
};

