Jiu-xiao/libxr/test/hardware/esp32s3_uart_loopback/main/esp_uart_fifo_test.cpp
void SetPartialFailure(EspUartFifoPartialConfigResult& result,
                       EspUartFifoPartialConfigFailure failure, LibXR::ErrorCode error)
{
  result.failure = failure;
  result.error = error;
}

void SetBackpressureFailure(EspUartFifoRxBackpressureResult& result,
                            EspUartFifoRxBackpressureFailure failure,
                            LibXR::ErrorCode error)
{
  result.failure = failure;
  result.error = error;
}

}  // namespace

EspUartFifoPartialConfigResult RunEspUartFifoPartialConfigTest(
    LibXR::ESP32UartFifo& uart, const EspUartFifoPartialConfigCase& test_case,
    LibXR::RawData tx_scratch, LibXR::RawData rx_scratch)
{
  EspUartFifoPartialConfigResult result;
  const uint64_t start_us = static_cast<uint64_t>(LibXR::Timebase::GetMicroseconds());

  if (test_case.observer_uart_num >= UART_NUM_MAX || test_case.observer_rx_pin < 0 ||
      test_case.frame_size <= SOC_UART_FIFO_LEN || test_case.operation_timeout_ms == 0U ||
      test_case.callback_quiet_time_ms == 0U || test_case.rx_quiet_time_ms == 0U ||
      tx_scratch.addr_ == nullptr || tx_scratch.size_ < test_case.frame_size ||
      rx_scratch.addr_ == nullptr ||
      rx_scratch.size_ < std::max(test_case.frame_size, size_t{2046U}))
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::INVALID_ARGUMENT,
                      LibXR::ErrorCode::ARG_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.retirement = RetireUartStressTraffic(
      uart,
      MakeBarrierCase(test_case.initial_config, test_case.operation_timeout_ms,
                      test_case.rx_quiet_time_ms),
      rx_scratch);
  if (!result.retirement.Passed())
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::PRECONDITION,
                      result.retirement.error);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  UartRxObserver observer(test_case.observer_uart_num);
  const LibXR::ErrorCode observer_setup = observer.Open(
      test_case.observer_rx_pin, test_case.frame_size * 2U, test_case.initial_config);
  if (observer_setup != LibXR::ErrorCode::OK)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::OBSERVER_SETUP,
                      observer_setup);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  auto* tx = static_cast<uint8_t*>(tx_scratch.addr_);
  FillPattern(tx, test_case.frame_size, 0U, test_case.pattern_seed);

  // A queued operation can outlive a timed-out test call. Retain both the callback
  // object and its state for the startup lifetime so every diagnostic return remains
  // memory-safe.
  auto* callback_state = new CallbackState;
  auto* callback =
      new LibXR::Callback<LibXR::ErrorCode>(LibXR::Callback<LibXR::ErrorCode>::Create(
          [](bool, CallbackState* state, LibXR::ErrorCode error)
          {
            state->last_error.store(static_cast<int32_t>(error),
                                    std::memory_order_relaxed);
            state->count.fetch_add(1U, std::memory_order_release);
          },
          callback_state));
  LibXR::WriteOperation operation(*callback);

  const auto write_result = uart.Write({tx, test_case.frame_size}, operation, false);
  if (write_result != LibXR::ErrorCode::OK)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::WRITE_SUBMIT,
                      write_result);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.queued_after_submit = uart.write_port_->Size();
  if (callback_state->count.load(std::memory_order_acquire) != 0U ||
      result.queued_after_submit == 0U ||
      result.queued_after_submit >= test_case.frame_size)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::NOT_PARTIALLY_LOADED,
                      LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.first_config_result = uart.SetConfig(test_case.requested_config);
  if (result.first_config_result != LibXR::ErrorCode::OK)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CONFIG_ADMISSION,
                      result.first_config_result);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.overlapping_config_result = uart.SetConfig(test_case.overlapping_config);
  if (result.overlapping_config_result != LibXR::ErrorCode::BUSY)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::OVERLAPPING_CONFIG,
                      result.overlapping_config_result);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  if (!WaitUntil([callback_state]()
                 { return callback_state->count.load(std::memory_order_acquire) != 0U; },
                 test_case.operation_timeout_ms))
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CALLBACK_TIMEOUT,
                      LibXR::ErrorCode::TIMEOUT);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.callback_count = callback_state->count.load(std::memory_order_acquire);
  result.callback_error = static_cast<LibXR::ErrorCode>(
      callback_state->last_error.load(std::memory_order_relaxed));
  if (result.callback_error != LibXR::ErrorCode::OK)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CALLBACK_STATUS,
                      result.callback_error);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  if (result.callback_count != 1U)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CALLBACK_COUNT,
                      LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  bool observer_read_failed = false;
  auto* const observed = static_cast<uint8_t*>(rx_scratch.addr_);
  result.observer_bytes =
      observer.Read(observed, test_case.frame_size, test_case.operation_timeout_ms,
                    observer_read_failed);
  if (observer_read_failed || (result.observer_bytes != test_case.frame_size))
  {
    SetPartialFailure(
        result, EspUartFifoPartialConfigFailure::OBSERVER_READ,
        observer_read_failed ? LibXR::ErrorCode::FAILED : LibXR::ErrorCode::TIMEOUT);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.observer_mismatch_offset =
      FindPatternMismatch(observed, test_case.frame_size, test_case.pattern_seed);
  if (result.observer_mismatch_offset != test_case.frame_size)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::OBSERVER_MISMATCH,
                      LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  uint8_t unexpected = 0U;
  result.observer_unexpected_bytes =
      observer.Read(&unexpected, 1U, test_case.rx_quiet_time_ms, observer_read_failed);
  if (observer_read_failed || (result.observer_unexpected_bytes != 0U))
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::OBSERVER_TRAILING,
                      LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  if (observer.Close() != LibXR::ErrorCode::OK)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::OBSERVER_TEARDOWN,
                      LibXR::ErrorCode::FAILED);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.retirement = RetireUartStressTraffic(
      uart,
      MakeBarrierCase(test_case.final_config, test_case.operation_timeout_ms,
                      test_case.rx_quiet_time_ms),
      rx_scratch);
  if (!result.retirement.Passed())
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::RETIREMENT,
                      result.retirement.error);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  LibXR::Thread::Sleep(test_case.callback_quiet_time_ms);
  result.callback_count = callback_state->count.load(std::memory_order_acquire);
  if (result.callback_count != 1U)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CALLBACK_COUNT,
                      LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.recovery = RunUartLoopbackTest(
      uart,
      MakeRecoveryCase(test_case.final_config, test_case.operation_timeout_ms,
                       test_case.rx_quiet_time_ms, test_case.pattern_seed ^ 0xA11CE001U),
      tx_scratch, rx_scratch);
  result.callback_count = callback_state->count.load(std::memory_order_acquire);
  if (result.callback_count != 1U)
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::CALLBACK_COUNT,
                      LibXR::ErrorCode::CHECK_ERR);
  }
  else if (!result.recovery.Passed())
  {
    SetPartialFailure(result, EspUartFifoPartialConfigFailure::RECOVERY,
                      result.recovery.error);
  }
  result.elapsed_us = ElapsedMicroseconds(start_us);
  return result;
}

EspUartFifoRxBackpressureResult RunEspUartFifoRxBackpressureTest(
    LibXR::ESP32UartFifo& uart, const EspUartFifoRxBackpressureCase& test_case,
    LibXR::RawData tx_scratch, LibXR::RawData rx_scratch)
{
  EspUartFifoRxBackpressureResult result;
  const uint64_t start_us = static_cast<uint64_t>(LibXR::Timebase::GetMicroseconds());
  const size_t total_size = test_case.rx_queue_size + test_case.retained_fifo_bytes;

