Jiu-xiao/libxr/test/hardware/esp32s3_uart_loopback/main/esp_uart_fifo_test.cpp
  if (test_case.rx_queue_size == 0U || test_case.retained_fifo_bytes == 0U ||
      test_case.retained_fifo_bytes >= SOC_UART_FIFO_LEN ||
      test_case.write_chunk_size == 0U || test_case.operation_timeout_ms == 0U ||
      test_case.rx_quiet_time_ms == 0U || tx_scratch.addr_ == nullptr ||
      tx_scratch.size_ < test_case.write_chunk_size || rx_scratch.addr_ == nullptr ||
      rx_scratch.size_ < test_case.rx_queue_size ||
      uart.read_port_->Size() + uart.read_port_->EmptySize() < test_case.rx_queue_size ||
      total_size < test_case.rx_queue_size)
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::INVALID_ARGUMENT,
                           LibXR::ErrorCode::ARG_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.precondition = RetireUartStressTraffic(
      uart,
      MakeBarrierCase(test_case.config, test_case.operation_timeout_ms,
                      test_case.rx_quiet_time_ms),
      rx_scratch);
  if (!result.precondition.Passed())
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::PRECONDITION,
                           result.precondition.error);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  auto* hw = UART_LL_GET_HW(test_case.uart_num);
  auto* tx = static_cast<uint8_t*>(tx_scratch.addr_);
  auto* rx = static_cast<uint8_t*>(rx_scratch.addr_);
  LibXR::Semaphore write_sem(0U);
  LibXR::WriteOperation write_operation(write_sem, test_case.operation_timeout_ms);

  for (size_t offset = 0U; offset < total_size;)
  {
    const size_t write_size = std::min(test_case.write_chunk_size, total_size - offset);
    FillPattern(tx, write_size, offset, test_case.pattern_seed);
    const auto write_result = uart.Write({tx, write_size}, write_operation, false);
    if (write_result != LibXR::ErrorCode::OK)
    {
      SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::WRITE,
                             write_result);
      result.elapsed_us = ElapsedMicroseconds(start_us);
      return result;
    }
    offset += write_size;
  }

  // Until this predicate succeeds, only non-destructive INT_ENA is sampled. FIFO
  // length and raw status are read below after the RX interrupt domain is masked.
  if (!WaitUntil(
          [&uart, hw, &test_case]()
          {
            return uart.read_port_->Size() == test_case.rx_queue_size &&
                   (uart_ll_get_intr_ena_status(hw) & RX_INTR_MASK) == 0U;
          },
          test_case.operation_timeout_ms))
  {
    result.queued_at_saturation = uart.read_port_->Size();
    result.rx_interrupts_when_full = uart_ll_get_intr_ena_status(hw) & RX_INTR_MASK;
    const auto failure = result.queued_at_saturation == test_case.rx_queue_size
                             ? EspUartFifoRxBackpressureFailure::RX_INTERRUPT_NOT_MASKED
                             : EspUartFifoRxBackpressureFailure::RX_QUEUE_TIMEOUT;
    SetBackpressureFailure(result, failure, LibXR::ErrorCode::TIMEOUT);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.queued_at_saturation = uart.read_port_->Size();
  result.rx_interrupts_when_full = uart_ll_get_intr_ena_status(hw) & RX_INTR_MASK;
  if (result.rx_interrupts_when_full != 0U)
  {
    SetBackpressureFailure(result,
                           EspUartFifoRxBackpressureFailure::RX_INTERRUPT_NOT_MASKED,
                           LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  if (!WaitUntil(
          [hw, &test_case]()
          {
            return static_cast<size_t>(uart_ll_get_rxfifo_len(hw)) ==
                   test_case.retained_fifo_bytes;
          },
          test_case.operation_timeout_ms))
  {
    result.fifo_tail_bytes = uart_ll_get_rxfifo_len(hw);
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::FIFO_TAIL_TIMEOUT,
                           LibXR::ErrorCode::TIMEOUT);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.fifo_tail_bytes = uart_ll_get_rxfifo_len(hw);
  result.raw_status_at_saturation = uart_ll_get_intraw_mask(hw) & RX_INTR_MASK;
  if ((result.raw_status_at_saturation & UART_INTR_RXFIFO_OVF) != 0U)
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::RX_OVERFLOW,
                           LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  LibXR::Semaphore read_sem(0U);
  LibXR::ReadOperation read_operation(read_sem, test_case.operation_timeout_ms);
  const auto prefix_read =
      uart.Read({rx, test_case.rx_queue_size}, read_operation, false);
  if (prefix_read != LibXR::ErrorCode::OK)
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::QUEUE_READ,
                           prefix_read);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  if (!MatchesPattern(rx, test_case.rx_queue_size, 0U, test_case.pattern_seed))
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::PREFIX_MISMATCH,
                           LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  result.verified_bytes = test_case.rx_queue_size;

  if (!WaitUntil([&uart, &test_case]()
                 { return uart.read_port_->Size() == test_case.retained_fifo_bytes; },
                 test_case.operation_timeout_ms))
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::RX_RESUME_TIMEOUT,
                           LibXR::ErrorCode::TIMEOUT);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  result.rx_interrupts_after_resume = uart_ll_get_intr_ena_status(hw) & RX_INTR_MASK;
  if (result.rx_interrupts_after_resume != RX_INTR_MASK)
  {
    SetBackpressureFailure(result,
                           EspUartFifoRxBackpressureFailure::RX_INTERRUPT_NOT_ENABLED,
                           LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }

  const auto tail_read =
      uart.Read({rx, test_case.retained_fifo_bytes}, read_operation, false);
  if (tail_read != LibXR::ErrorCode::OK)
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::TAIL_READ,
                           tail_read);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  if (!MatchesPattern(rx, test_case.retained_fifo_bytes, test_case.rx_queue_size,
                      test_case.pattern_seed))
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::TAIL_MISMATCH,
                           LibXR::ErrorCode::CHECK_ERR);
    result.elapsed_us = ElapsedMicroseconds(start_us);
    return result;
  }
  result.verified_bytes += test_case.retained_fifo_bytes;

  result.recovery = RunUartLoopbackTest(
      uart,
      MakeRecoveryCase(test_case.recovery_config, test_case.operation_timeout_ms,
                       test_case.rx_quiet_time_ms, test_case.pattern_seed ^ 0xBACC0001U),
      tx_scratch, rx_scratch);
  if (!result.recovery.Passed())
  {
    SetBackpressureFailure(result, EspUartFifoRxBackpressureFailure::RECOVERY,
                           result.recovery.error);
  }
  result.elapsed_us = ElapsedMicroseconds(start_us);
  return result;
}

const char* EspUartFifoPartialConfigFailureName(EspUartFifoPartialConfigFailure failure)
{
  switch (failure)
  {
    case EspUartFifoPartialConfigFailure::NONE:
      return "NONE";
    case EspUartFifoPartialConfigFailure::INVALID_ARGUMENT:
      return "INVALID_ARGUMENT";
    case EspUartFifoPartialConfigFailure::PRECONDITION:
      return "PRECONDITION";
    case EspUartFifoPartialConfigFailure::OBSERVER_SETUP:
      return "OBSERVER_SETUP";
    case EspUartFifoPartialConfigFailure::WRITE_SUBMIT:
      return "WRITE_SUBMIT";
    case EspUartFifoPartialConfigFailure::NOT_PARTIALLY_LOADED:
      return "NOT_PARTIALLY_LOADED";
    case EspUartFifoPartialConfigFailure::CONFIG_ADMISSION:
      return "CONFIG_ADMISSION";
    case EspUartFifoPartialConfigFailure::OVERLAPPING_CONFIG:
      return "OVERLAPPING_CONFIG";
    case EspUartFifoPartialConfigFailure::CALLBACK_TIMEOUT:
      return "CALLBACK_TIMEOUT";
    case EspUartFifoPartialConfigFailure::CALLBACK_STATUS:
      return "CALLBACK_STATUS";
    case EspUartFifoPartialConfigFailure::CALLBACK_COUNT:
      return "CALLBACK_COUNT";
    case EspUartFifoPartialConfigFailure::OBSERVER_READ:
      return "OBSERVER_READ";
    case EspUartFifoPartialConfigFailure::OBSERVER_MISMATCH:
      return "OBSERVER_MISMATCH";
    case EspUartFifoPartialConfigFailure::OBSERVER_TRAILING:
      return "OBSERVER_TRAILING";
    case EspUartFifoPartialConfigFailure::OBSERVER_TEARDOWN:
      return "OBSERVER_TEARDOWN";
    case EspUartFifoPartialConfigFailure::RETIREMENT:
      return "RETIREMENT";
    case EspUartFifoPartialConfigFailure::RECOVERY:
      return "RECOVERY";
  }
  return "UNKNOWN";
}

const char* EspUartFifoRxBackpressureFailureName(EspUartFifoRxBackpressureFailure failure)
{
  switch (failure)
  {
    case EspUartFifoRxBackpressureFailure::NONE:
      return "NONE";
    case EspUartFifoRxBackpressureFailure::INVALID_ARGUMENT:
      return "INVALID_ARGUMENT";
    case EspUartFifoRxBackpressureFailure::PRECONDITION:
      return "PRECONDITION";
    case EspUartFifoRxBackpressureFailure::WRITE:
      return "WRITE";
    case EspUartFifoRxBackpressureFailure::RX_QUEUE_TIMEOUT:
      return "RX_QUEUE_TIMEOUT";
    case EspUartFifoRxBackpressureFailure::RX_INTERRUPT_NOT_MASKED:
      return "RX_INTERRUPT_NOT_MASKED";
    case EspUartFifoRxBackpressureFailure::FIFO_TAIL_TIMEOUT:
      return "FIFO_TAIL_TIMEOUT";
    case EspUartFifoRxBackpressureFailure::RX_OVERFLOW:
      return "RX_OVERFLOW";
    case EspUartFifoRxBackpressureFailure::QUEUE_READ:
      return "QUEUE_READ";
    case EspUartFifoRxBackpressureFailure::PREFIX_MISMATCH:
      return "PREFIX_MISMATCH";
    case EspUartFifoRxBackpressureFailure::RX_RESUME_TIMEOUT:
      return "RX_RESUME_TIMEOUT";
    case EspUartFifoRxBackpressureFailure::RX_INTERRUPT_NOT_ENABLED:
      return "RX_INTERRUPT_NOT_ENABLED";
    case EspUartFifoRxBackpressureFailure::TAIL_READ:
      return "TAIL_READ";
    case EspUartFifoRxBackpressureFailure::TAIL_MISMATCH:
      return "TAIL_MISMATCH";
    case EspUartFifoRxBackpressureFailure::RECOVERY:
      return "RECOVERY";
  }
  return "UNKNOWN";
}

}  // namespace LibXRTest
